//package consoleInterface.Commands;
//
///**
// * Интерфейс, представляющий команду консольного интерфейса.
// * <p>
// * Все команды должны реализовывать этот интерфейс, предоставляя метод {@code execute()},
// * который будет выполнять соответствующее действие в рамках консольного приложения.
// * </p>
// */
//public interface IConsoleCommand {
//    /**
//     * Выполняет действие, связанное с конкретной командой.
//     * <p>
//     * Метод, реализующий логику команды. Этот метод будет вызываться для выполнения
//     * соответствующего действия в рамках консольного интерфейса.
//     * </p>
//     */
//    void execute();
//}
